src/Documents/ПланМеню.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ПланМеню</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОбработан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогТоваров</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КаталогиТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КатегорияЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеУстанавливатьЦенуРеализацииИзПланМеню</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОчиститьНаличиеВПродаже</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОшибкаПрименения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаРеализации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УстанавливатьПараметрыПодбораВЗаказе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УстанавливатьПризнакНаличияВПродаже</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УстановитьТипЦенМестаРеализации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяКонца</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПосетителей</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Выход</Name>
							<Comment>Выход готового блюда, в граммах</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Comment>Цена реализации</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторТовара</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КогдаВПродажеВремя1</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КогдаВПродажеВремя2</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КогдаВПродаже</Name>
							<Comment>по дням недели</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕстьВПродаже</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Специфики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторТовара</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КогдаВПродажеВремя1</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КогдаВПродажеВремя2</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КогдаВПродаже</Name>
							<Comment>по дням недели</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕстьВПродаже</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСтрокиТовара</Name>
							<Comment>для связи с товарами</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КогдаВПродажеПоНеделям</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаПонедельника</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторТовара</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Documents/ПланМеню/Forms/ФормаДокумента/module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

Процедура ПриОткрытии()
	
	ТолькоПросмотр = Истина;
	
	Если глВерсия=1 Тогда
		ЭлементыФормы.Панель1.Страницы.Специфики.Видимость = Ложь;
	КонецЕсли; 
	//Если ЭтоНовый() Тогда
	//	ДокументОбработан = Ложь;
	//КонецЕсли; 
	
КонецПроцедуры

// Процедура обновляет отображение элементов формы.
//
Процедура ОбновлениеОтображения()
	
	ОбновитьПодвал();
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ТАБЛИЧНОЙ ЧАСТИ ТОВАРЫ НА ЗАКЛАДКЕ СПЕЦИФИКИ

// Процедура - обработчик события ПриВыводеСтроки табличной части
// "Товары". Формирует данные в колонке "Всего".
//
Процедура Товары1ПриВыводеСтроки(Элемент, ОформлениеСтроки, ДанныеСтроки)

	Если ЗначениеЗаполнено(ДанныеСтроки.КогдаВПродаже) Тогда
		ОформлениеСтроки.Ячейки.ПризнакНаличияВПродаже.ОтображатьФлажок = Истина;
		ОформлениеСтроки.Ячейки.ПризнакНаличияВПродаже.Флажок	= Истина;
	Иначе
		ОформлениеСтроки.Ячейки.ПризнакНаличияВПродаже.ОтображатьФлажок = Ложь;
	КонецЕсли;
	
КонецПроцедуры


///////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ТАБЛИЧНОЙ ЧАСТИ СПЕЦИФИКИ


// Заполнить дерево товаров специфик
//
Процедура ЗаполнитьДеревоТоваровСпецифик()

	ДеревоТоваров.Строки.Очистить();
	Для Каждого СтрокаТЧ Из Товары Цикл  
		СтрокаТовара = ДеревоТоваров.Строки.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТовара, СтрокаТЧ);
		
		МассивСпецифик = Специфики.НайтиСтроки(Новый Структура("ИдентификаторТовара", СтрокаТЧ.ИдентификаторТовара));
		Для Каждого СтрокаСпецифики Из МассивСпецифик Цикл 
			НоваяСтрока = СтрокаТовара.Строки.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаСпецифики);
			НоваяСтрока.Номенклатура = СтрокаСпецифики.Номенклатура;
		КонецЦикла;
		ЭлементыФормы.ДеревоТоваров.Развернуть(СтрокаТовара);
		
	КонецЦикла;			

КонецПроцедуры // ЗаполнитьДеревоТоваровСпецифик()


///////////////////////////////////////////////////////////////////////////////////
// ПРОЧИЕ ОБРАБОТЧИКИ 

// Процедура формирует текст в информационной надписи об итогах документа.
//
// Параметры:
//  Нет.
//
Процедура ОбновитьПодвал()

	ВременнаяСтрока = "";
	Если ЗначениеЗаполнено(КатегорияЦен) Тогда
		ВременнаяСтрока = ВременнаяСтрока + "Категория цен: " + КатегорияЦен;
	Иначе
		ВременнаяСтрока = ВременнаяСтрока + "Категория цен: Не заполнено!";
	КонецЕсли;

	ЭлементыФормы.ИнфНадписьТоварыИтоги.Заголовок = ВременнаяСтрока;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ УПРАВЛЕНИЯ ВНЕШНИМ ВИДОМ ФОРМЫ

Процедура Панель2ПриСменеСтраницы(Элемент, ТекущаяСтраница)

	Если ЭлементыФормы.Панель2.ТекущаяСтраница = ЭлементыФормы.Панель2.Страницы.ДеревоСпецифик Тогда
		ЗаполнитьДеревоТоваровСпецифик();
	КонецЕсли;
	
КонецПроцедуры

Процедура Панель1ПриСменеСтраницы(Элемент, ТекущаяСтраница)

	Если ЭлементыФормы.Панель2.ТекущаяСтраница = ЭлементыФормы.Панель2.Страницы.ДеревоСпецифик Тогда
		ЗаполнитьДеревоТоваровСпецифик();
	КонецЕсли;
	
КонецПроцедуры

Процедура Товары1ПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если Копирование Тогда
		Элемент.ТекущаяСтрока.ИдентификаторТовара = "";
	КонецЕсли;
	
КонецПроцедуры

Процедура Товары1ПриАктивизацииСтроки(Элемент)
	
	Если НЕ ЭлементыФормы.Товары1.ТекущиеДанные = Неопределено Тогда
		ЭлементыФормы.Специфики.ОтборСтрок.ИдентификаторТовара.Значение			= ЭлементыФормы.Товары1.ТекущиеДанные.ИдентификаторТовара;
		ЭлементыФормы.Специфики.ОтборСтрок.ИдентификаторТовара.Использование	= Истина;
		
		МассивСтрок = Новый Массив;
		Для каждого ВыделеннаяСтрока Из ЭлементыФормы.Товары1.ВыделенныеСтроки Цикл
			МассивСтрок.Добавить(ВыделеннаяСтрока);
		КонецЦикла;
		
		Оповестить("АктивизацияСтрокиТабличнойЧастиДокументаПланМеню", МассивСтрок, ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры


Процедура НаличиеВПродаже(Кнопка)
	
	ФормаРедактированияНаличияВПродаже = ЭтотОбъект.ПолучитьФорму("ФормаРедактированияНаличияВПродаже", ЭтаФорма, ЭтотОбъект);
	ФормаРедактированияНаличияВПродаже.ДокументОбъект = ЭтотОбъект;
	ФормаРедактированияНаличияВПродаже.ЗакрыватьПриЗакрытииВладельца = Истина;
	ФормаРедактированияНаличияВПродаже.ТолькоПросмотр = ЭтаФорма.ТолькоПросмотр;
	ФормаРедактированияНаличияВПродаже.Открыть();
	
	Если Кнопка.Имя = "НаличиеВПродажеТовары" Тогда
		МассивСтрок = Новый Массив;
		Для каждого ВыделеннаяСтрока Из ЭлементыФормы.Товары1.ВыделенныеСтроки Цикл
			Если НЕ ЗначениеЗаполнено(ВыделеннаяСтрока.ИдентификаторТовара) Тогда
				ВыделеннаяСтрока.ИдентификаторТовара = Новый УникальныйИдентификатор;
			КонецЕсли;
			МассивСтрок.Добавить(ВыделеннаяСтрока);
		КонецЦикла;
	Иначе
		МассивСтрок = Новый Массив;
		Для каждого ВыделеннаяСтрока Из ЭлементыФормы.Специфики.ВыделенныеСтроки Цикл
			МассивСтрок.Добавить(ВыделеннаяСтрока);
		КонецЦикла;
	КонецЕсли;
	
	Если НЕ МассивСтрок = Неопределено Тогда
		Оповестить("АктивизацияСтрокиТабличнойЧастиДокументаПланМеню", МассивСтрок, ЭтотОбъект);
	КонецЕсли;
	
	
КонецПроцедуры

Процедура СпецификиПриАктивизацииСтроки(Элемент)
	
	МассивСтрок = Новый Массив;
	Для каждого ВыделеннаяСтрока Из ЭлементыФормы.Специфики.ВыделенныеСтроки Цикл
		МассивСтрок.Добавить(ВыделеннаяСтрока);
	КонецЦикла;
	
	Оповестить("АктивизацияСтрокиТабличнойЧастиДокументаПланМеню", МассивСтрок, ЭтотОбъект);
	
КонецПроцедуры

Процедура СпецификиПриВыводеСтроки(Элемент, ОформлениеСтроки, ДанныеСтроки)
	
	Если ЗначениеЗаполнено(ДанныеСтроки.КогдаВПродаже) Тогда
		ОформлениеСтроки.Ячейки.ПризнакНаличияВПродаже.ОтображатьФлажок	= Истина;
		ОформлениеСтроки.Ячейки.ПризнакНаличияВПродаже.Флажок	= Истина;
	Иначе
		ОформлениеСтроки.Ячейки.ПризнакНаличияВПродаже.ОтображатьФлажок	= Ложь;
	КонецЕсли;
	
КонецПроцедуры
